-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: May 11, 2025 at 12:30 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `parstech_db1`
--

-- --------------------------------------------------------

--
-- Table structure for table `bank_accounts`
--

CREATE TABLE `bank_accounts` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `person_id` bigint(20) UNSIGNED NOT NULL,
  `bank_name` varchar(255) DEFAULT NULL,
  `branch` varchar(255) DEFAULT NULL,
  `account_number` varchar(255) DEFAULT NULL,
  `card_number` varchar(255) DEFAULT NULL,
  `iban` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `bank_accounts`
--

INSERT INTO `bank_accounts` (`id`, `person_id`, `bank_name`, `branch`, `account_number`, `card_number`, `iban`, `created_at`, `updated_at`) VALUES
(1, 8, 'ملی', 'نقاب', '335149658454', '56546514651265146', '2169874964', '2025-05-10 04:40:32', '2025-05-10 04:40:32'),
(2, 11, 'سی', 'بسی', '54', '65616161465', '6516516', '2025-05-10 05:41:11', '2025-05-10 05:41:11'),
(3, 13, 'ملی', 'نقاب', NULL, NULL, NULL, '2025-05-10 05:47:48', '2025-05-10 05:47:48');

-- --------------------------------------------------------

--
-- Table structure for table `brands`
--

CREATE TABLE `brands` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `image` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `brands`
--

INSERT INTO `brands` (`id`, `name`, `image`, `created_at`, `updated_at`) VALUES
(1, 'تسکو', NULL, '2025-05-11 03:33:11', '2025-05-11 03:33:11');

-- --------------------------------------------------------

--
-- Table structure for table `cache`
--

CREATE TABLE `cache` (
  `key` varchar(255) NOT NULL,
  `value` mediumtext NOT NULL,
  `expiration` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `cache_locks`
--

CREATE TABLE `cache_locks` (
  `key` varchar(255) NOT NULL,
  `owner` varchar(255) NOT NULL,
  `expiration` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `type` varchar(255) DEFAULT NULL,
  `code` varchar(255) DEFAULT NULL,
  `category_type` varchar(255) NOT NULL DEFAULT 'کالا',
  `parent_id` bigint(20) UNSIGNED DEFAULT NULL,
  `description` text DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `name`, `type`, `code`, `category_type`, `parent_id`, `description`, `image`, `created_at`, `updated_at`) VALUES
(1, 'اداری', NULL, 'per1001', 'person', NULL, NULL, NULL, '2025-05-09 19:02:45', '2025-05-09 19:02:45'),
(2, 'مدارس', NULL, 'per1002', 'person', 1, 'سیهعبمهشسیع', NULL, '2025-05-10 13:12:57', '2025-05-10 13:12:57'),
(3, 'کامپیوتر', NULL, 'pro1001', 'product', NULL, NULL, NULL, '2025-05-11 03:32:55', '2025-05-11 03:32:55');

-- --------------------------------------------------------

--
-- Table structure for table `cities`
--

CREATE TABLE `cities` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `province_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `cities`
--

INSERT INTO `cities` (`id`, `province_id`, `name`) VALUES
(11, 1, 'آبش احمد'),
(18, 1, 'آذرشهر'),
(36, 1, 'آقکند'),
(51, 1, 'اچاچی'),
(59, 1, 'اربطان'),
(89, 1, 'اسکو'),
(134, 1, 'اهر'),
(144, 1, 'ایلخچی'),
(167, 1, 'باسمنج'),
(187, 1, 'بخشایش'),
(205, 1, 'بستان آباد'),
(219, 1, 'بناب'),
(220, 1, 'بناب مرند'),
(307, 1, 'تبریز'),
(312, 1, 'ترک'),
(314, 1, 'ترکمانچای'),
(315, 1, 'تسوج'),
(334, 1, 'تیکمه داش'),
(335, 1, 'تیمورلو'),
(347, 1, 'جلفا'),
(357, 1, 'جوان قلعه'),
(435, 1, 'خاروانا'),
(439, 1, 'خامنه'),
(445, 1, 'خداجو(خراجو)'),
(453, 1, 'خسروشاه'),
(463, 1, 'خمارلو'),
(473, 1, 'خواجه'),
(484, 1, 'خوشه مهر'),
(492, 1, 'داریان'),
(531, 1, 'دوزدوزان'),
(625, 1, 'زرنق'),
(635, 1, 'زنوز'),
(661, 1, 'سراب'),
(677, 1, 'سردرود'),
(731, 1, 'سهند'),
(743, 1, 'سیس'),
(749, 1, 'سیه رود'),
(766, 1, 'شبستر'),
(768, 1, 'شربیان'),
(769, 1, 'شرفخانه'),
(781, 1, 'شندآباد'),
(826, 1, 'صوفیان'),
(840, 1, 'عاشقلو'),
(843, 1, 'عجب شیر'),
(855, 1, 'علیشاه'),
(919, 1, 'قره آغاج'),
(982, 1, 'کشکسرای'),
(992, 1, 'کلوانق'),
(994, 1, 'کلیبر'),
(1012, 1, 'کوزه کنان'),
(1083, 1, 'گوگان'),
(1093, 1, 'لاریجان'),
(1118, 1, 'لیلان'),
(1133, 1, 'مبارک شهر'),
(1153, 1, 'مراغه'),
(1160, 1, 'مرند'),
(1189, 1, 'ملکان'),
(1190, 1, 'ممقان'),
(1210, 1, 'مهربان'),
(1220, 1, 'میانه'),
(1255, 1, 'نظرکهریزی'),
(1312, 1, 'هادیشهر'),
(1320, 1, 'هریس'),
(1325, 1, 'هشترود'),
(1339, 1, 'هوراند'),
(1297, 1, 'وایقان'),
(1303, 1, 'ورزقان'),
(1347, 1, 'یامچی'),
(41, 2, 'آواجیق'),
(75, 2, 'ارومیه'),
(101, 2, 'اشنویه'),
(149, 2, 'ایواوغلی'),
(163, 2, 'باروق'),
(165, 2, 'بازرگان'),
(243, 2, 'بوکان'),
(289, 2, 'پلدشت'),
(293, 2, 'پیرانشهر'),
(301, 2, 'تازه شهر'),
(303, 2, 'تازه کندنصرت آباد'),
(319, 2, 'تکاب'),
(409, 2, 'چهاربرج'),
(415, 2, 'حاجیلار'),
(460, 2, 'خلیفان'),
(486, 2, 'خوی'),
(553, 2, 'دیزج دیز'),
(575, 2, 'ربط'),
(620, 2, 'زرآباد'),
(678, 2, 'سردشت'),
(687, 2, 'سرو'),
(705, 2, 'سلماس'),
(744, 2, 'سیلوانه'),
(746, 2, 'سیمینه'),
(748, 2, 'سیه چشمه'),
(762, 2, 'شاهین دژ'),
(785, 2, 'شوط'),
(897, 2, 'فیرورق'),
(921, 2, 'قره ضیاءالدین'),
(929, 2, 'قطور'),
(944, 2, 'قوشچی'),
(981, 2, 'کشاورز'),
(1082, 2, 'گوگ تپه'),
(1091, 2, 'لاجان'),
(1126, 2, 'ماکو'),
(1145, 2, 'محمدیار'),
(1148, 2, 'محمودآباد'),
(1159, 2, 'مرگنلر'),
(1203, 2, 'مهاباد'),
(1216, 2, 'میاندوآب'),
(1223, 2, 'میرآباد'),
(1233, 2, 'نازک علیا'),
(1236, 2, 'نالوس'),
(1257, 2, 'نقده'),
(1263, 2, 'نلاس'),
(1280, 2, 'نوشین'),
(1352, 2, 'یولاگلدی'),
(14, 3, 'آبی بیگلو'),
(20, 3, 'آراللو'),
(63, 3, 'اردبیل'),
(68, 3, 'اردیموسی'),
(91, 3, 'اسلام اباد'),
(104, 3, 'اصلاندوز'),
(111, 3, 'النی'),
(271, 3, 'بیله سوار'),
(273, 3, 'پارس آباد'),
(302, 3, 'تازه کندانگوت'),
(336, 3, 'ثمرین'),
(343, 3, 'جعفرآباد'),
(459, 3, 'خلخال'),
(587, 3, 'رضی'),
(638, 3, 'زهرا'),
(682, 3, 'سرعین'),
(859, 3, 'عنبران'),
(872, 3, 'فخراباد'),
(924, 3, 'قصابه'),
(993, 3, 'کلور'),
(1010, 3, 'کوراییم'),
(1051, 3, 'گرمی'),
(1090, 3, 'گیوی'),
(1098, 3, 'لاهرود'),
(1152, 3, 'مرادلو'),
(1175, 3, 'مشگین شهر'),
(1183, 3, 'مغان سر'),
(1264, 3, 'نمین'),
(1287, 3, 'نیر'),
(1324, 3, 'هشتجین'),
(1344, 3, 'هیر'),
(21, 4, 'آران وبیدگل'),
(46, 4, 'ابریشم'),
(48, 4, 'ابوزیدآباد'),
(64, 4, 'اردستان'),
(80, 4, 'اژیه'),
(102, 4, 'اصغرآباد'),
(103, 4, 'اصفهان'),
(107, 4, 'افوس'),
(127, 4, 'انارک'),
(145, 4, 'ایمانشهر'),
(160, 4, 'بادرود'),
(169, 4, 'باغ بهادران'),
(172, 4, 'باغشاد'),
(175, 4, 'بافران'),
(195, 4, 'برزک'),
(197, 4, 'برف انبار'),
(250, 4, 'بهاران شهر'),
(251, 4, 'بهارستان'),
(247, 4, 'بویین ومیاندشت'),
(264, 4, 'بیده'),
(294, 4, 'پیربکران'),
(327, 4, 'تودشک'),
(332, 4, 'تیران'),
(353, 4, 'جندق'),
(361, 4, 'جوزدان'),
(363, 4, 'جوشقان قالی'),
(374, 4, 'چادگان'),
(386, 4, 'چرمهین'),
(399, 4, 'چمگردان'),
(416, 4, 'حبیب آباد'),
(420, 4, 'حسن اباد'),
(431, 4, 'حنا'),
(438, 4, 'خالدآباد'),
(467, 4, 'خمینی شهر'),
(475, 4, 'خوانسار'),
(476, 4, 'خور'),
(478, 4, 'خورزوق'),
(490, 4, 'داران'),
(496, 4, 'دامنه'),
(504, 4, 'درچه'),
(515, 4, 'دستگرد'),
(540, 4, 'ده سرخ'),
(542, 4, 'دهاقان'),
(548, 4, 'دهق'),
(537, 4, 'دولت آباد'),
(554, 4, 'دیزیچه'),
(578, 4, 'رزوه'),
(584, 4, 'رضوانشهر'),
(613, 4, 'زازران'),
(619, 4, 'زاینده رود'),
(629, 4, 'زرین شهر'),
(636, 4, 'زواره'),
(642, 4, 'زیار'),
(645, 4, 'زیباشهر'),
(658, 4, 'سجزی'),
(660, 4, 'سده لنجان'),
(696, 4, 'سفیدشهر'),
(709, 4, 'سمیرم'),
(747, 4, 'سین'),
(750, 4, 'شاپورآباد'),
(763, 4, 'شاهین شهر'),
(798, 4, 'شهرضا'),
(831, 4, 'طالخونچه'),
(837, 4, 'طرق رود'),
(845, 4, 'عسگران'),
(851, 4, 'علویجه'),
(870, 4, 'فتح آباد'),
(879, 4, 'فرخی'),
(886, 4, 'فریدونشهر'),
(892, 4, 'فلاورجان'),
(894, 4, 'فولادشهر'),
(940, 4, 'قمصر'),
(947, 4, 'قهجاورستان'),
(948, 4, 'قهدریجان'),
(959, 4, 'کاشان'),
(964, 4, 'کامو و چوگان'),
(976, 4, 'کرکوند'),
(995, 4, 'کلیشادوسودرجان'),
(997, 4, 'کمشچه'),
(998, 4, 'کمه'),
(1026, 4, 'کهریزسنگ'),
(1013, 4, 'کوشک'),
(1017, 4, 'کوهپایه'),
(1045, 4, 'گرگاب'),
(1053, 4, 'گزبرخوار'),
(1060, 4, 'گلپایگان'),
(1061, 4, 'گلدشت'),
(1065, 4, 'گلشن'),
(1066, 4, 'گلشهر'),
(1084, 4, 'گوگد'),
(1100, 4, 'لای بید'),
(1134, 4, 'مبارکه'),
(1135, 4, 'مجلسی'),
(1138, 4, 'محمدآباد'),
(1171, 4, 'مشکات'),
(1195, 4, 'منظریه'),
(1202, 4, 'مهاباد'),
(1228, 4, 'میمه'),
(1237, 4, 'نایین'),
(1238, 4, 'نجف آباد'),
(1248, 4, 'نصرآباد'),
(1252, 4, 'نطنز'),
(1278, 4, 'نوش آباد'),
(1286, 4, 'نیاسر'),
(1290, 4, 'نیک آباد'),
(1319, 4, 'هرند'),
(1304, 4, 'ورزنه'),
(1305, 4, 'ورنامخواست'),
(1306, 4, 'وزوان'),
(1308, 4, 'ونک'),
(26, 5, 'آسارا'),
(98, 5, 'اشتهارد'),
(290, 5, 'پلنگ آباد'),
(322, 5, 'تنکمان'),
(408, 5, 'چهارباغ'),
(795, 5, 'شهرجدیدهشتگرد'),
(832, 5, 'طالقان'),
(972, 5, 'کرج'),
(996, 5, 'کمال شهر'),
(1019, 5, 'کوهسار'),
(1048, 5, 'گرمدره'),
(1063, 5, 'گلسار'),
(1131, 5, 'ماهدشت'),
(1142, 5, 'محمدشهر'),
(1174, 5, 'مشکین دشت'),
(1254, 5, 'نظرآباد'),
(1326, 5, 'هشتگرد'),
(8, 6, 'آبدانان'),
(30, 6, 'آسمان آباد'),
(73, 6, 'ارکواز'),
(143, 6, 'ایلام'),
(147, 6, 'ایوان'),
(188, 6, 'بدره'),
(210, 6, 'بلاوه'),
(292, 6, 'پهله'),
(326, 6, 'توحید'),
(344, 6, 'جعفراباد'),
(387, 6, 'چشمه شیرین'),
(404, 6, 'چوار'),
(510, 6, 'دره شهر'),
(521, 6, 'دلگشا'),
(551, 6, 'دهلران'),
(626, 6, 'زرنه'),
(662, 6, 'سراب باغ'),
(664, 6, 'سرابله'),
(764, 6, 'شباب'),
(811, 6, 'صالح آباد'),
(1113, 6, 'لومار'),
(1122, 6, 'ماژین'),
(1207, 6, 'مهر'),
(1209, 6, 'مهران'),
(1199, 6, 'مورموری'),
(1200, 6, 'موسیان'),
(1229, 6, 'میمه'),
(2, 7, 'آب پخش'),
(3, 7, 'آباد'),
(7, 7, 'آبدان'),
(116, 7, 'امام حسن'),
(126, 7, 'انارستان'),
(135, 7, 'اهرم'),
(161, 7, 'بادوله'),
(189, 7, 'برازجان'),
(190, 7, 'بردخون'),
(191, 7, 'بردستان'),
(228, 7, 'بندردیر'),
(229, 7, 'بندردیلم'),
(230, 7, 'بندرریگ'),
(232, 7, 'بندرکنگان'),
(234, 7, 'بندرگناوه'),
(238, 7, 'بنک'),
(252, 7, 'بهارستان'),
(241, 7, 'بوشکان'),
(242, 7, 'بوشهر'),
(261, 7, 'بیدخون'),
(323, 7, 'تنگ ارم'),
(349, 7, 'جم'),
(381, 7, 'چاه مبارک'),
(388, 7, 'چغادک'),
(434, 7, 'خارک'),
(480, 7, 'خورموج'),
(494, 7, 'دالکی'),
(523, 7, 'دلوار'),
(529, 7, 'دوراهک'),
(606, 7, 'ریز'),
(693, 7, 'سعد آباد'),
(737, 7, 'سیراف'),
(765, 7, 'شبانکاره'),
(780, 7, 'شنبه'),
(841, 7, 'عالی شهر'),
(846, 7, 'عسلویه'),
(962, 7, 'کاکی'),
(991, 7, 'کلمه'),
(1240, 7, 'نخل تقی'),
(1298, 7, 'وحدتیه'),
(10, 8, 'آبسرد'),
(12, 8, 'آبعلی'),
(52, 8, 'احمد آباد مستوفی'),
(60, 8, 'ارجمند'),
(93, 8, 'اسلامشهر'),
(130, 8, 'اندیشه'),
(171, 8, 'باغستان'),
(177, 8, 'باقرشهر'),
(244, 8, 'بومهن'),
(277, 8, 'پاکدشت'),
(281, 8, 'پردیس'),
(282, 8, 'پرند'),
(297, 8, 'پیشوا'),
(308, 8, 'تجریش'),
(330, 8, 'تهران'),
(355, 8, 'جوادآباد'),
(410, 8, 'چهاردانگه'),
(419, 8, 'حسن آباد'),
(525, 8, 'دماوند'),
(574, 8, 'رباطکریم'),
(598, 8, 'رودهن'),
(603, 8, 'ری'),
(758, 8, 'شاهدشهر'),
(771, 8, 'شریف آباد'),
(779, 8, 'شمشک'),
(800, 8, 'شهریار'),
(815, 8, 'صالحیه'),
(817, 8, 'صباشهر'),
(820, 8, 'صفادشت'),
(881, 8, 'فردوسیه'),
(884, 8, 'فرون اباد'),
(891, 8, 'فشم'),
(901, 8, 'فیروزکوه'),
(912, 8, 'قدس'),
(914, 8, 'قرچک'),
(936, 8, 'قلعه نو'),
(950, 8, 'قیام دشت'),
(1027, 8, 'کهریزک'),
(1037, 8, 'کیلان'),
(1064, 8, 'گلستان'),
(1109, 8, 'لواسان'),
(1186, 8, 'ملارد'),
(1245, 8, 'نسیم شهر'),
(1251, 8, 'نصیرشهر'),
(1299, 8, 'وحیدیه'),
(1300, 8, 'ورامین'),
(38, 9, 'آلونی'),
(67, 9, 'اردل'),
(152, 9, 'باباحیدر'),
(166, 9, 'بازفت'),
(200, 9, 'بروجن'),
(212, 9, 'بلداجی'),
(218, 9, 'بن'),
(280, 9, 'پردنجان'),
(366, 9, 'جونقان'),
(393, 9, 'چلگرد'),
(394, 9, 'چلیچه'),
(516, 9, 'دستنا'),
(517, 9, 'دشتک'),
(652, 9, 'سامان'),
(674, 9, 'سرخون'),
(679, 9, 'سردشت'),
(694, 9, 'سفیددشت'),
(719, 9, 'سودجان'),
(721, 9, 'سورشجان'),
(777, 9, 'شلمزار'),
(799, 9, 'شهرکرد'),
(825, 9, 'صمصامی'),
(830, 9, 'طاقانک'),
(862, 9, 'فارسان'),
(874, 9, 'فرادبنه'),
(878, 9, 'فرخ شهر'),
(904, 9, 'فیل اباد'),
(953, 9, 'کاج'),
(1034, 9, 'کیان'),
(1077, 9, 'گندمان'),
(1086, 9, 'گهرو'),
(1078, 9, 'گوجان'),
(1102, 9, 'لردگان'),
(1127, 9, 'مال خلیفه'),
(1192, 9, 'منج'),
(1234, 9, 'ناغان'),
(1235, 9, 'نافچ'),
(1258, 9, 'نقنه'),
(1313, 9, 'هارونی'),
(1329, 9, 'هفشجان'),
(1340, 9, 'هوره'),
(1302, 9, 'وردنجان'),
(1348, 9, 'یان چشمه'),
(15, 10, 'آبیز'),
(23, 10, 'آرین شهر'),
(44, 10, 'آیسک'),
(70, 10, 'ارسک'),
(85, 10, 'اسدیه'),
(86, 10, 'اسفدن'),
(94, 10, 'اسلامیه'),
(208, 10, 'بشرویه'),
(266, 10, 'بیرجند'),
(412, 10, 'حاجی آباد'),
(458, 10, 'خضری دشت بیاض'),
(482, 10, 'خوسف'),
(505, 10, 'درح'),
(558, 10, 'دیهوک'),
(637, 10, 'زهان'),
(666, 10, 'سرایان'),
(668, 10, 'سربیشه'),
(729, 10, 'سه قلعه'),
(782, 10, 'شوسف'),
(833, 10, 'طبس'),
(834, 10, 'طبس مسینا'),
(847, 10, 'عشق آباد'),
(880, 10, 'فردوس'),
(911, 10, 'قاین'),
(949, 10, 'قهستان'),
(1055, 10, 'گزیک'),
(1143, 10, 'محمدشهر'),
(1198, 10, 'مود'),
(1284, 10, 'نهبندان'),
(1294, 10, 'نیمبلوک'),
(54, 11, 'احمدابادصولت'),
(124, 11, 'انابد'),
(158, 11, 'باجگیران'),
(159, 11, 'باخرز'),
(162, 11, 'بار'),
(182, 11, 'بایک'),
(184, 11, 'بجستان'),
(192, 11, 'بردسکن'),
(260, 11, 'بیدخت'),
(306, 11, 'تایباد'),
(310, 11, 'تربت جام'),
(311, 11, 'تربت حیدریه'),
(346, 11, 'جغتای'),
(354, 11, 'جنگل'),
(373, 11, 'چاپشلو'),
(384, 11, 'چخماق'),
(391, 11, 'چکنه'),
(401, 11, 'چناران'),
(425, 11, 'حکم اباد'),
(452, 11, 'خرو'),
(461, 11, 'خلیل آباد'),
(474, 11, 'خواف'),
(499, 11, 'داورزن'),
(507, 11, 'درگز'),
(509, 11, 'درود'),
(538, 11, 'دولت آباد'),
(573, 11, 'رباط سنگ'),
(583, 11, 'رشتخوار'),
(586, 11, 'رضویه'),
(593, 11, 'روداب'),
(609, 11, 'ریواده'),
(610, 11, 'ریوش'),
(655, 11, 'سبزوار'),
(672, 11, 'سرخس'),
(695, 11, 'سفیدسنگ'),
(699, 11, 'سلامی'),
(700, 11, 'سلطان آباد'),
(710, 11, 'سمیع آباد'),
(715, 11, 'سنگان'),
(752, 11, 'شادمهر'),
(755, 11, 'شاندیز'),
(773, 11, 'ششتمد'),
(792, 11, 'شهراباد'),
(796, 11, 'شهرزو'),
(812, 11, 'صالح آباد'),
(838, 11, 'طرقبه'),
(848, 11, 'عشق آباد'),
(885, 11, 'فرهادگرد'),
(889, 11, 'فریمان'),
(902, 11, 'فیروزه'),
(903, 11, 'فیض آباد'),
(907, 11, 'قاسم آباد'),
(913, 11, 'قدمگاه'),
(937, 11, 'قلعه نوعلیا'),
(938, 11, 'قلندرآباد'),
(942, 11, 'قوچان'),
(954, 11, 'کاخک'),
(957, 11, 'کاریز'),
(960, 11, 'کاشمر'),
(971, 11, 'کدکن'),
(984, 11, 'کلات'),
(1002, 11, 'کندر'),
(1059, 11, 'گلبهار'),
(1068, 11, 'گلمکان'),
(1074, 11, 'گناباد'),
(1104, 11, 'لطف آباد'),
(1166, 11, 'مزدآوند'),
(1172, 11, 'مشکان'),
(1176, 11, 'مشهد'),
(1177, 11, 'مشهد ثامن'),
(1178, 11, 'مشهدریزه'),
(1188, 11, 'ملک آباد'),
(1247, 11, 'نشتیفان'),
(1249, 11, 'نصرآباد'),
(1256, 11, 'نقاب'),
(1268, 11, 'نوخندان'),
(1289, 11, 'نیشابور'),
(1293, 11, 'نیل شهر'),
(1333, 11, 'همت آباد'),
(1353, 11, 'یونسی'),
(33, 12, 'آشخانه'),
(40, 12, 'آوا'),
(87, 12, 'اسفراین'),
(150, 12, 'ایور'),
(185, 12, 'بجنورد'),
(296, 12, 'پیش قلعه'),
(331, 12, 'تیتکانلو'),
(337, 12, 'جاجرم'),
(402, 12, 'چناران شهر'),
(424, 12, 'حصارگرمخان'),
(506, 12, 'درق'),
(560, 12, 'راز'),
(643, 12, 'زیارت'),
(712, 12, 'سنخواست'),
(786, 12, 'شوقان'),
(806, 12, 'شیروان'),
(823, 12, 'صفی آباد'),
(861, 12, 'غلامان'),
(864, 12, 'فاروج'),
(908, 12, 'قاضی'),
(945, 12, 'قوشخانه'),
(1050, 12, 'گرمه'),
(1110, 12, 'لوجلی'),
(1351, 12, 'یکه سعود'),
(4, 13, 'آبادان'),
(9, 13, 'آبژدان'),
(25, 13, 'آزادی'),
(34, 13, 'آغاجاری'),
(47, 13, 'ابوحمیظه'),
(76, 13, 'اروندکنار'),
(114, 13, 'الهایی'),
(112, 13, 'الوان'),
(120, 13, 'امیدیه'),
(131, 13, 'اندیمشک'),
(137, 13, 'اهواز'),
(139, 13, 'ایذه'),
(170, 13, 'باغ ملک'),
(204, 13, 'بستان'),
(224, 13, 'بندرامام خمینی'),
(236, 13, 'بندرماهشهر'),
(253, 13, 'بهبهان'),
(262, 13, 'بیدروبه'),
(313, 13, 'ترکالکی'),
(316, 13, 'تشان'),
(340, 13, 'جایزان'),
(352, 13, 'جنت مکان'),
(365, 13, 'جولکی'),
(389, 13, 'چغامیش'),
(396, 13, 'چم گلک'),
(397, 13, 'چمران'),
(407, 13, 'چویبده'),
(417, 13, 'حر'),
(423, 13, 'حسینیه'),
(427, 13, 'حمزه'),
(429, 13, 'حمیدیه'),
(451, 13, 'خرمشهر'),
(468, 13, 'خنافره'),
(491, 13, 'دارخوین'),
(512, 13, 'دزفول'),
(545, 13, 'دهدز'),
(566, 13, 'رامشیر'),
(567, 13, 'رامهرمز'),
(589, 13, 'رفیع'),
(592, 13, 'رود زرد ماشین'),
(615, 13, 'زاووت'),
(639, 13, 'زهره'),
(651, 13, 'سالند'),
(676, 13, 'سرداران'),
(680, 13, 'سردشت'),
(701, 13, 'سلطان آباد'),
(707, 13, 'سماله'),
(726, 13, 'سوسنگرد'),
(733, 13, 'سیاه منصور'),
(751, 13, 'شادگان'),
(756, 13, 'شاوور'),
(767, 13, 'شرافت'),
(778, 13, 'شمس آباد'),
(791, 13, 'شهر امام'),
(802, 13, 'شهیون'),
(783, 13, 'شوش'),
(784, 13, 'شوشتر'),
(803, 13, 'شیبان'),
(814, 13, 'صالح شهر'),
(824, 13, 'صفی آباد'),
(828, 13, 'صیدون'),
(844, 13, 'عرب حسن'),
(857, 13, 'عنبر'),
(871, 13, 'فتح المبین'),
(931, 13, 'قلعه تل'),
(932, 13, 'قلعه خواجه'),
(1007, 13, 'کوت سیدنعیم'),
(1008, 13, 'کوت عبداله'),
(1040, 13, 'گتوند'),
(1067, 13, 'گلگیر'),
(1081, 13, 'گوریه'),
(1096, 13, 'لالی'),
(1169, 13, 'مسجدسلیمان'),
(1170, 13, 'مشراگه'),
(1184, 13, 'مقاومت'),
(1185, 13, 'ملاثانی'),
(1191, 13, 'منتظران'),
(1194, 13, 'منصوریه'),
(1217, 13, 'میانرود'),
(1219, 13, 'میانکوه'),
(1222, 13, 'میداود'),
(1232, 13, 'مینوشهر'),
(1328, 13, 'هفتگل'),
(1336, 13, 'هندیجان'),
(1341, 13, 'هویزه'),
(1309, 13, 'ویس'),
(1, 14, 'آب بر'),
(50, 14, 'ابهر'),
(74, 14, 'ارمغانخانه'),
(406, 14, 'چورزق'),
(426, 14, 'حلب'),
(449, 14, 'خرمدره'),
(527, 14, 'دندی'),
(627, 14, 'زرین آباد'),
(628, 14, 'زرین رود'),
(631, 14, 'زنجان'),
(657, 14, 'سجاس'),
(703, 14, 'سلطانیه'),
(730, 14, 'سهرورد'),
(816, 14, 'صایین قلعه'),
(951, 14, 'قیدار'),
(974, 14, 'کرسف'),
(1047, 14, 'گرماب'),
(1129, 14, 'ماه نشان'),
(1276, 14, 'نوربهار'),
(1291, 14, 'نیک پی'),
(1342, 14, 'هیدج'),
(19, 15, 'آرادان'),
(122, 15, 'امیریه'),
(148, 15, 'ایوانکی'),
(207, 15, 'بسطام'),
(258, 15, 'بیارجمند'),
(495, 15, 'دامغان'),
(503, 15, 'درجزین'),
(552, 15, 'دیباج'),
(599, 15, 'رودیان'),
(675, 15, 'سرخه'),
(708, 15, 'سمنان'),
(760, 15, 'شاهرود'),
(801, 15, 'شهمیرزاد'),
(985, 15, 'کلاته'),
(986, 15, 'کلاته خیج'),
(1029, 15, 'کهن آباد'),
(1049, 15, 'گرمسار'),
(1136, 15, 'مجن'),
(1206, 15, 'مهدی شهر'),
(1214, 15, 'میامی'),
(31, 16, 'آشار'),
(57, 16, 'ادیمی'),
(82, 16, 'اسپکه'),
(95, 16, 'اسماعیل آباد'),
(140, 16, 'ایرانشهر'),
(202, 16, 'بزمان'),
(217, 16, 'بمپور'),
(222, 16, 'بنت'),
(223, 16, 'بنجار'),
(275, 16, 'پارود'),
(287, 16, 'پلان'),
(298, 16, 'پیشین'),
(338, 16, 'جالق'),
(342, 16, 'جزینک'),
(379, 16, 'چاه بهار'),
(392, 16, 'چگرد'),
(436, 16, 'خاش'),
(539, 16, 'ده رییس'),
(535, 16, 'دوست محمد'),
(563, 16, 'راسک'),
(607, 16, 'ریگ ملک'),
(611, 16, 'زابل'),
(617, 16, 'زاهدان'),
(621, 16, 'زرآباد'),
(640, 16, 'زهک'),
(648, 16, 'ساربوک'),
(665, 16, 'سراوان'),
(667, 16, 'سرباز'),
(670, 16, 'سرجنگل'),
(720, 16, 'سوران'),
(740, 16, 'سیرکان'),
(854, 16, 'علی اکبر'),
(893, 16, 'فنوج'),
(916, 16, 'قرقری'),
(926, 16, 'قصرقند'),
(1001, 16, 'کنارک'),
(1041, 16, 'گتیج'),
(1056, 16, 'گشت'),
(1069, 16, 'گلمورتی'),
(1139, 16, 'محمدآباد'),
(1141, 16, 'محمدان'),
(1144, 16, 'محمدی'),
(1212, 16, 'مهرستان'),
(1225, 16, 'میرجاوه'),
(1250, 16, 'نصرت آباد'),
(1261, 16, 'نگور'),
(1281, 16, 'نوک آباد'),
(1292, 16, 'نیک شهر'),
(1343, 16, 'هیدوچ'),
(5, 17, 'آباده'),
(6, 17, 'آباده طشک'),
(61, 17, 'ارد'),
(65, 17, 'اردکان'),
(71, 17, 'ارسنجان'),
(83, 17, 'استهبان'),
(96, 17, 'اسیر'),
(100, 17, 'اشکنان'),
(106, 17, 'افزر'),
(109, 17, 'اقلید'),
(117, 17, 'امام شهر'),
(136, 17, 'اهل'),
(133, 17, 'اوز'),
(138, 17, 'ایج'),
(141, 17, 'ایزدخواست'),
(151, 17, 'باب انار'),
(154, 17, 'بابامنیر'),
(178, 17, 'بالاده'),
(221, 17, 'بنارویه'),
(256, 17, 'بهمن'),
(239, 17, 'بوانات'),
(267, 17, 'بیرم'),
(269, 17, 'بیضا'),
(351, 17, 'جنت شهر'),
(369, 17, 'جهرم'),
(368, 17, 'جویم'),
(382, 17, 'چاه ورز'),
(413, 17, 'حاجی آباد'),
(418, 17, 'حسامی'),
(421, 17, 'حسن اباد'),
(442, 17, 'خانه زنیان'),
(443, 17, 'خانیمن'),
(444, 17, 'خاوران'),
(446, 17, 'خرامه'),
(454, 17, 'خشت'),
(469, 17, 'خنج'),
(477, 17, 'خور'),
(481, 17, 'خوزی'),
(485, 17, 'خومه زار'),
(487, 17, 'خیراباد'),
(489, 17, 'داراب'),
(493, 17, 'داریان'),
(500, 17, 'دبیران'),
(513, 17, 'دژکرد'),
(547, 17, 'دهرم'),
(549, 17, 'دهکویه'),
(528, 17, 'دوبرجی'),
(532, 17, 'دوزه'),
(564, 17, 'رامجرد'),
(579, 17, 'رستاق'),
(600, 17, 'رونیز'),
(618, 17, 'زاهدشهر'),
(622, 17, 'زرقان'),
(634, 17, 'زنگی اباد'),
(659, 17, 'سده'),
(689, 17, 'سروستان'),
(692, 17, 'سعادت شهر'),
(702, 17, 'سلطان شهر'),
(723, 17, 'سورمق'),
(736, 17, 'سیدان'),
(774, 17, 'ششده'),
(794, 17, 'شهرپیر'),
(797, 17, 'شهرصدرا'),
(804, 17, 'شیراز'),
(819, 17, 'صغاد'),
(821, 17, 'صفاشهر'),
(839, 17, 'طسوج'),
(850, 17, 'علامرودشت'),
(856, 17, 'عماد شهر'),
(865, 17, 'فاروق'),
(868, 17, 'فال'),
(873, 17, 'فدامی'),
(875, 17, 'فراشبند'),
(890, 17, 'فسا'),
(898, 17, 'فیروزآباد'),
(906, 17, 'قادراباد'),
(910, 17, 'قایمیه'),
(920, 17, 'قره بلاغ'),
(927, 17, 'قطب آباد'),
(928, 17, 'قطرویه'),
(952, 17, 'قیر'),
(956, 17, 'کارزین (فتح آباد)'),
(958, 17, 'کازرون'),
(963, 17, 'کامفیروز'),
(980, 17, 'کره ای'),
(1000, 17, 'کنارتخته'),
(1005, 17, 'کوار'),
(1006, 17, 'کوپن'),
(1022, 17, 'کوهنجان'),
(1044, 17, 'گراش'),
(1071, 17, 'گله دار'),
(1092, 17, 'لار'),
(1097, 17, 'لامرد'),
(1101, 17, 'لپویی'),
(1105, 17, 'لطیفی'),
(1119, 17, 'مادرسلیمان'),
(1132, 17, 'مبارک آباددیز'),
(1147, 17, 'محمله'),
(1161, 17, 'مرودشت'),
(1165, 17, 'مزایجان'),
(1173, 17, 'مشکان'),
(1179, 17, 'مصیری'),
(1180, 17, 'معزابادجابری'),
(1208, 17, 'مهر'),
(1218, 17, 'میانشهر'),
(1227, 17, 'میمند'),
(1266, 17, 'نوبندگان'),
(1267, 17, 'نوجین'),
(1269, 17, 'نودان'),
(1274, 17, 'نورآباد'),
(1285, 17, 'نی ریز'),
(1331, 17, 'هماشهر'),
(1301, 17, 'وراوی'),
(13, 18, 'آبگرم'),
(16, 18, 'آبیک'),
(42, 18, 'آوج'),
(62, 18, 'ارداق'),
(88, 18, 'اسفرورین'),
(108, 18, 'اقبالیه'),
(113, 18, 'الوند'),
(245, 18, 'بویین زهرا'),
(263, 18, 'بیدستان'),
(305, 18, 'تاکستان'),
(437, 18, 'خاکعلی'),
(450, 18, 'خرمدشت'),
(497, 18, 'دانسفهان'),
(562, 18, 'رازمیان'),
(698, 18, 'سگزآباد'),
(739, 18, 'سیردان'),
(754, 18, 'شال'),
(772, 18, 'شریفیه'),
(829, 18, 'ضیاآباد'),
(922, 18, 'قزوین'),
(1025, 18, 'کوهین'),
(1146, 18, 'محمدیه'),
(1150, 18, 'محمودآبادنمونه'),
(1181, 18, 'معلم کلایه'),
(1243, 18, 'نرجه'),
(345, 19, 'جعفریه'),
(514, 19, 'دستجرد'),
(704, 19, 'سلفچگان'),
(939, 19, 'قم'),
(941, 19, 'قنوات'),
(1028, 19, 'کهک'),
(22, 20, 'آرمرده'),
(132, 20, 'اورامان تخت'),
(153, 20, 'بابارشانی'),
(181, 20, 'بانه'),
(194, 20, 'برده رشه'),
(211, 20, 'بلبان آباد'),
(246, 20, 'بویین سفلی'),
(259, 20, 'بیجار'),
(295, 20, 'پیرتاج'),
(324, 20, 'توپ آغاج'),
(403, 20, 'چناره'),
(422, 20, 'حسین آباد'),
(511, 20, 'دزج'),
(520, 20, 'دلبران'),
(550, 20, 'دهگلان'),
(557, 20, 'دیواندره'),
(630, 20, 'زرینه'),
(688, 20, 'سروآباد'),
(690, 20, 'سریش آباد'),
(697, 20, 'سقز'),
(711, 20, 'سنته'),
(718, 20, 'سنندج'),
(788, 20, 'شویشه'),
(809, 20, 'صاحب'),
(917, 20, 'قروه'),
(965, 20, 'کامیاران'),
(966, 20, 'کانی دینار'),
(967, 20, 'کانی سور'),
(1164, 20, 'مریوان'),
(1197, 20, 'موچش'),
(1321, 20, 'هزارکانیان'),
(1346, 20, 'یاسوکند'),
(56, 21, 'اختیارآباد'),
(69, 21, 'ارزوییه'),
(123, 21, 'امین شهر'),
(125, 21, 'انار'),
(129, 21, 'اندوهجرد'),
(173, 21, 'باغین'),
(174, 21, 'بافت'),
(193, 21, 'بردسیر'),
(198, 21, 'بروات'),
(203, 21, 'بزنجان'),
(214, 21, 'بلورد'),
(215, 21, 'بلوک'),
(216, 21, 'بم'),
(254, 21, 'بهرمان'),
(276, 21, 'پاریز'),
(341, 21, 'جبالبارز'),
(356, 21, 'جوادیه الهیه'),
(359, 21, 'جوپار'),
(362, 21, 'جوزم'),
(370, 21, 'جیرفت'),
(380, 21, 'چاه دادخدا'),
(383, 21, 'چترود'),
(433, 21, 'خاتون اباد'),
(441, 21, 'خانوک'),
(472, 21, 'خواجو شهر'),
(479, 21, 'خورسند'),
(501, 21, 'درب بهشت'),
(518, 21, 'دشتکار'),
(541, 21, 'ده کهان'),
(544, 21, 'دهج'),
(534, 21, 'دوساری'),
(559, 21, 'رابر'),
(570, 21, 'راور'),
(571, 21, 'راین'),
(588, 21, 'رفسنجان'),
(590, 21, 'رمشک'),
(594, 21, 'رودبار'),
(605, 21, 'ریحان'),
(624, 21, 'زرند'),
(633, 21, 'زنگی آباد'),
(641, 21, 'زهکلوت'),
(646, 21, 'زیدآباد'),
(738, 21, 'سیرجان'),
(741, 21, 'سیریز'),
(790, 21, 'شهداد'),
(793, 21, 'شهربابک'),
(822, 21, 'صفاییه'),
(852, 21, 'علی اباد'),
(858, 21, 'عنبرآباد'),
(866, 21, 'فاریاب'),
(896, 21, 'فهرج'),
(935, 21, 'قلعه گنج'),
(961, 21, 'کاظم آباد'),
(977, 21, 'کرمان'),
(983, 21, 'کشکوییه'),
(1030, 21, 'کهنوج'),
(1016, 21, 'کوهبنان'),
(1035, 21, 'کیانشهر'),
(1058, 21, 'گلباف'),
(1062, 21, 'گلزار'),
(1076, 21, 'گنبکی'),
(1095, 21, 'لاله زار'),
(1130, 21, 'ماهان'),
(1140, 21, 'محمدآباد'),
(1151, 21, 'محی آباد'),
(1156, 21, 'مردهک'),
(1168, 21, 'مس سرچشمه'),
(1196, 21, 'منوجان'),
(1239, 21, 'نجف شهر'),
(1244, 21, 'نرماشیر'),
(1253, 21, 'نظام شهر'),
(1260, 21, 'نگار'),
(1270, 21, 'نودژ'),
(1314, 21, 'هجدک'),
(1332, 21, 'هماشهر'),
(1337, 21, 'هنزا'),
(1350, 21, 'یزدان شهر'),
(77, 22, 'ازگله'),
(90, 22, 'اسلام آبادغرب'),
(180, 22, 'بانوره'),
(183, 22, 'باینگان'),
(268, 22, 'بیستون'),
(278, 22, 'پاوه'),
(300, 22, 'تازه آباد'),
(358, 22, 'جوانرود'),
(430, 22, 'حمیل'),
(572, 22, 'رباط'),
(591, 22, 'روانسر'),
(604, 22, 'ریجاب'),
(669, 22, 'سرپل ذهاب'),
(686, 22, 'سرمست'),
(691, 22, 'سطر'),
(714, 22, 'سنقر'),
(728, 22, 'سومار'),
(761, 22, 'شاهو'),
(770, 22, 'شروینه'),
(818, 22, 'صحنه'),
(925, 22, 'قصرشیرین'),
(930, 22, 'قلعه'),
(978, 22, 'کرمانشاه'),
(979, 22, 'کرند'),
(1004, 22, 'کنگاور'),
(1011, 22, 'کوزران'),
(1087, 22, 'گهواره'),
(1079, 22, 'گودین'),
(1089, 22, 'گیلانغرب'),
(1215, 22, 'میان راهان'),
(1224, 22, 'میرآباد'),
(1271, 22, 'نودشه'),
(1277, 22, 'نوسود'),
(1317, 22, 'هرسین'),
(1330, 22, 'هلشی'),
(168, 23, 'باشت'),
(240, 23, 'بوستان'),
(272, 23, 'پاتاوه'),
(385, 23, 'چرام'),
(411, 23, 'چیتاب'),
(546, 23, 'دهدشت'),
(536, 23, 'دوگنبدان'),
(555, 23, 'دیشموک'),
(683, 23, 'سرفاریاب'),
(727, 23, 'سوق'),
(732, 23, 'سی سخت'),
(933, 23, 'قلعه رییسی'),
(1043, 23, 'گراب سفلی'),
(1107, 23, 'لنده'),
(1117, 23, 'لیکک'),
(1120, 23, 'مادوان'),
(1121, 23, 'مارگون'),
(1345, 23, 'یاسوج'),
(24, 24, 'آزادشهر'),
(35, 24, 'آق قلا'),
(128, 24, 'انبارآلوم'),
(146, 24, 'اینچه برون'),
(226, 24, 'بندرترکمن'),
(233, 24, 'بندرگز'),
(299, 24, 'تاتارعلیا'),
(348, 24, 'جلین'),
(440, 24, 'خان ببین'),
(522, 24, 'دلند'),
(533, 24, 'دوزین'),
(568, 24, 'رامیان'),
(673, 24, 'سرخنکلاته'),
(716, 24, 'سنگدوین'),
(735, 24, 'سیجوال'),
(745, 24, 'سیمین شهر'),
(810, 24, 'صادق اباد'),
(853, 24, 'علی اباد'),
(867, 24, 'فاضل آباد'),
(876, 24, 'فراغی'),
(915, 24, 'قرق'),
(973, 24, 'کردکوی'),
(990, 24, 'کلاله'),
(1038, 24, 'گالیکش'),
(1046, 24, 'گرگان'),
(1072, 24, 'گلیداغ'),
(1073, 24, 'گمیش تپه'),
(1075, 24, 'گنبدکاووس'),
(1154, 24, 'مراوه'),
(1167, 24, 'مزرعه'),
(1231, 24, 'مینودشت'),
(1262, 24, 'نگین شهر'),
(1272, 24, 'نوده خاندوز'),
(1282, 24, 'نوکنده'),
(27, 25, 'آستارا'),
(29, 25, 'آستانه اشرفیه'),
(55, 25, 'احمدسرگوراب'),
(81, 25, 'اسالم'),
(105, 25, 'اطاقور'),
(119, 25, 'املش'),
(164, 25, 'بازار جمعه'),
(201, 25, 'بره سر'),
(225, 25, 'بندرانزلی'),
(284, 25, 'پره سر'),
(325, 25, 'توتکابن'),
(371, 25, 'جیرنده'),
(372, 25, 'چابکسر'),
(376, 25, 'چاف و چمخاله'),
(405, 25, 'چوبر'),
(432, 25, 'حویق'),
(455, 25, 'خشکبیجار'),
(464, 25, 'خمام'),
(556, 25, 'دیلمان'),
(569, 25, 'رانکوه'),
(576, 25, 'رحیم آباد'),
(580, 25, 'رستم آباد'),
(582, 25, 'رشت'),
(585, 25, 'رضوانشهر'),
(595, 25, 'رودبار'),
(596, 25, 'رودبنه'),
(597, 25, 'رودسر'),
(717, 25, 'سنگر'),
(734, 25, 'سیاهکل'),
(775, 25, 'شفت'),
(776, 25, 'شلمان'),
(827, 25, 'صومعه سرا'),
(895, 25, 'فومن'),
(987, 25, 'کلاچای'),
(1009, 25, 'کوچصفهان'),
(1015, 25, 'کومله'),
(1032, 25, 'کیاشهر'),
(1080, 25, 'گوراب زرمیخ'),
(1099, 25, 'لاهیجان'),
(1103, 25, 'لشت نشاء'),
(1108, 25, 'لنگرود'),
(1111, 25, 'لوشان'),
(1112, 25, 'لولمان'),
(1114, 25, 'لوندویل'),
(1116, 25, 'لیسار'),
(1123, 25, 'ماسال'),
(1124, 25, 'ماسوله'),
(1125, 25, 'ماکلوان'),
(1155, 25, 'مرجقل'),
(1193, 25, 'منجیل'),
(1323, 25, 'هشتپر (تالش)'),
(1296, 25, 'واجارگاه'),
(78, 26, 'ازنا'),
(97, 26, 'اشترینان'),
(110, 26, 'الشتر'),
(115, 26, 'الیگودرز'),
(199, 26, 'بروجرد'),
(265, 26, 'بیران شهر'),
(288, 26, 'پلدختر'),
(377, 26, 'چالانچولان'),
(390, 26, 'چقابل'),
(395, 26, 'چم پلک'),
(400, 26, 'چمن سلطان'),
(447, 26, 'خرم آباد'),
(502, 26, 'درب گنبد'),
(530, 26, 'دورود'),
(614, 26, 'زاغه'),
(656, 26, 'سپیددشت'),
(663, 26, 'سراب دوره'),
(724, 26, 'سوری'),
(757, 26, 'شاهپوراباد'),
(787, 26, 'شول آباد'),
(899, 26, 'فیروزآباد'),
(1018, 26, 'کوهدشت'),
(1021, 26, 'کوهنانی'),
(1042, 26, 'گراب'),
(1182, 26, 'معمولان'),
(1201, 26, 'مومن آباد'),
(1275, 26, 'نورآباد'),
(1327, 26, 'هفت چشمه'),
(1307, 26, 'ونایی'),
(1310, 26, 'ویسیان'),
(37, 27, 'آلاشت'),
(39, 27, 'آمل'),
(72, 27, 'ارطه'),
(118, 27, 'امامزاده عبدالله'),
(121, 27, 'امیرکلا'),
(142, 27, 'ایزدشهر'),
(155, 27, 'بابکان'),
(156, 27, 'بابل'),
(157, 27, 'بابلسر'),
(213, 27, 'بلده'),
(255, 27, 'بهشهر'),
(257, 27, 'بهنمیر'),
(279, 27, 'پایین هولار'),
(286, 27, 'پل سفید'),
(291, 27, 'پول'),
(321, 27, 'تنکابن'),
(367, 27, 'جویبار'),
(378, 27, 'چالوس'),
(398, 27, 'چمستان'),
(448, 27, 'خرم آباد'),
(462, 27, 'خلیل شهر'),
(483, 27, 'خوش رودپی'),
(488, 27, 'دابودشت'),
(565, 27, 'رامسر'),
(581, 27, 'رستمکلا'),
(601, 27, 'رویان'),
(608, 27, 'رینه'),
(623, 27, 'زرگرمحله'),
(647, 27, 'زیرآب'),
(650, 27, 'ساری'),
(671, 27, 'سرخرود'),
(706, 27, 'سلمان شهر'),
(722, 27, 'سورک'),
(805, 27, 'شیرگاه'),
(807, 27, 'شیرود'),
(835, 27, 'طبقده'),
(842, 27, 'عباس اباد'),
(877, 27, 'فرح آباد'),
(887, 27, 'فریدونکنار'),
(888, 27, 'فریم'),
(909, 27, 'قایم شهر'),
(969, 27, 'کتالم وسادات شهر'),
(970, 27, 'کجور'),
(988, 27, 'کلارآباد'),
(989, 27, 'کلاردشت'),
(1023, 27, 'کوهی خیل'),
(1031, 27, 'کیاسر'),
(1033, 27, 'کیاکلا'),
(1039, 27, 'گتاب'),
(1054, 27, 'گزنک'),
(1070, 27, 'گلوگاه'),
(1149, 27, 'محمودآباد'),
(1157, 27, 'مرزن آباد'),
(1158, 27, 'مرزیکلا'),
(1246, 27, 'نشتارود'),
(1259, 27, 'نکا'),
(1273, 27, 'نور'),
(1279, 27, 'نوشهر'),
(1311, 27, 'هادی شهر'),
(1315, 27, 'هچیرود'),
(28, 28, 'آستانه'),
(32, 28, 'آشتیان'),
(43, 28, 'آوه'),
(58, 28, 'اراک'),
(283, 28, 'پرندک'),
(318, 28, 'تفرش'),
(320, 28, 'تلخاب'),
(328, 28, 'توره'),
(339, 28, 'جاورسیان'),
(456, 28, 'خشکرود'),
(466, 28, 'خمین'),
(470, 28, 'خنجین'),
(471, 28, 'خنداب'),
(498, 28, 'داودآباد'),
(524, 28, 'دلیجان'),
(561, 28, 'رازقان'),
(616, 28, 'زاویه'),
(649, 28, 'ساروق'),
(654, 28, 'ساوه'),
(753, 28, 'شازند'),
(789, 28, 'شهباز'),
(860, 28, 'غرق آباد'),
(883, 28, 'فرمهین'),
(943, 28, 'قورچی باشی'),
(955, 28, 'کارچان'),
(999, 28, 'کمیجان'),
(1128, 28, 'مامونیه'),
(1137, 28, 'محلات'),
(1204, 28, 'مهاجران'),
(1226, 28, 'میلاجرد'),
(1242, 28, 'نراق'),
(1265, 28, 'نوبران'),
(1295, 28, 'نیمور'),
(1335, 28, 'هندودر'),
(49, 29, 'ابوموسی'),
(179, 29, 'بالاشهر'),
(206, 29, 'بستک'),
(227, 29, 'بندرجاسک'),
(231, 29, 'بندرعباس'),
(235, 29, 'بندرلنگه'),
(237, 29, 'بندزرک'),
(270, 29, 'بیکاء'),
(274, 29, 'پارسیان'),
(285, 29, 'پل'),
(304, 29, 'تازیان پایین'),
(309, 29, 'تخت'),
(333, 29, 'تیرور'),
(350, 29, 'جناح'),
(375, 29, 'چارک'),
(414, 29, 'حاجی اباد'),
(465, 29, 'خمیر'),
(508, 29, 'درگهان'),
(519, 29, 'دشتی'),
(543, 29, 'دهبارز'),
(602, 29, 'رویدر'),
(644, 29, 'زیارتعلی'),
(681, 29, 'سردشت'),
(685, 29, 'سرگز'),
(713, 29, 'سندرک'),
(725, 29, 'سوزا'),
(742, 29, 'سیریک'),
(836, 29, 'طبل'),
(863, 29, 'فارغان'),
(905, 29, 'فین'),
(923, 29, 'قشم'),
(934, 29, 'قلعه قاضی'),
(1003, 29, 'کنگ'),
(1014, 29, 'کوشکنار'),
(1020, 29, 'کوهستک'),
(1024, 29, 'کوهیچ'),
(1036, 29, 'کیش'),
(1052, 29, 'گروک'),
(1085, 29, 'گوهران'),
(1106, 29, 'لمزان'),
(1115, 29, 'لیردف'),
(1230, 29, 'میناب'),
(1318, 29, 'هرمز'),
(1322, 29, 'هشتبندی'),
(1338, 29, 'هنگوییه'),
(17, 30, 'آجین'),
(79, 30, 'ازندریان'),
(84, 30, 'اسدآباد'),
(92, 30, 'اسلام شهر آق گل'),
(196, 30, 'برزول'),
(249, 30, 'بهار'),
(329, 30, 'تویسرکان'),
(360, 30, 'جورقان'),
(364, 30, 'جوکار'),
(526, 30, 'دمق'),
(577, 30, 'رزن'),
(632, 30, 'زنگنه'),
(653, 30, 'سامن'),
(684, 30, 'سرکان'),
(808, 30, 'شیرین سو'),
(813, 30, 'صالح آباد'),
(869, 30, 'فامنین'),
(882, 30, 'فرسفج'),
(900, 30, 'فیروزان'),
(918, 30, 'قروه درگزین'),
(946, 30, 'قهاوند'),
(968, 30, 'کبودرآهنگ'),
(975, 30, 'کرفس'),
(1057, 30, 'گل تپه'),
(1088, 30, 'گیان'),
(1094, 30, 'لالجین'),
(1163, 30, 'مریانج'),
(1187, 30, 'ملایر'),
(1205, 30, 'مهاجران'),
(1283, 30, 'نهاوند'),
(1334, 30, 'همدان'),
(45, 31, 'ابرکوه'),
(53, 31, 'احمدآباد'),
(66, 31, 'اردکان'),
(99, 31, 'اشکذر'),
(176, 31, 'بافق'),
(186, 31, 'بخ'),
(209, 31, 'بفروییه'),
(248, 31, 'بهاباد'),
(317, 31, 'تفت'),
(428, 31, 'حمیدیا'),
(457, 31, 'خضرآباد'),
(612, 31, 'زارچ'),
(759, 31, 'شاهدیه'),
(849, 31, 'عقدا'),
(1162, 31, 'مروست'),
(1211, 31, 'مهردشت'),
(1213, 31, 'مهریز'),
(1221, 31, 'میبد'),
(1241, 31, 'ندوشن'),
(1288, 31, 'نیر'),
(1316, 31, 'هرات'),
(1349, 31, 'یزد');

-- --------------------------------------------------------

--
-- Table structure for table `currencies`
--

CREATE TABLE `currencies` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) NOT NULL,
  `symbol` varchar(255) DEFAULT NULL,
  `code` varchar(255) DEFAULT NULL,
  `is_active` tinyint(1) NOT NULL DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `currencies`
--

INSERT INTO `currencies` (`id`, `title`, `symbol`, `code`, `is_active`, `created_at`, `updated_at`) VALUES
(1, 'ریال', 'ریال', 'rfial', 1, '2025-05-10 16:44:41', '2025-05-10 16:44:41'),
(3, 'ریال', 'ir-rial', 'iranrial', 1, '2025-05-10 16:56:38', '2025-05-10 16:56:38');

-- --------------------------------------------------------

--
-- Table structure for table `customers`
--

CREATE TABLE `customers` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `expenses`
--

CREATE TABLE `expenses` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) NOT NULL,
  `amount` bigint(20) NOT NULL,
  `expense_date` date DEFAULT NULL,
  `note` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `uuid` varchar(255) NOT NULL,
  `connection` text NOT NULL,
  `queue` text NOT NULL,
  `payload` longtext NOT NULL,
  `exception` longtext NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `incomes`
--

CREATE TABLE `incomes` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `customer_id` bigint(20) UNSIGNED DEFAULT NULL,
  `title` varchar(255) NOT NULL,
  `amount` bigint(20) NOT NULL,
  `income_date` date DEFAULT NULL,
  `note` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `invoices`
--

CREATE TABLE `invoices` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `number` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `jobs`
--

CREATE TABLE `jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `queue` varchar(255) NOT NULL,
  `payload` longtext NOT NULL,
  `attempts` tinyint(3) UNSIGNED NOT NULL,
  `reserved_at` int(10) UNSIGNED DEFAULT NULL,
  `available_at` int(10) UNSIGNED NOT NULL,
  `created_at` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `job_batches`
--

CREATE TABLE `job_batches` (
  `id` varchar(255) NOT NULL,
  `name` varchar(255) NOT NULL,
  `total_jobs` int(11) NOT NULL,
  `pending_jobs` int(11) NOT NULL,
  `failed_jobs` int(11) NOT NULL,
  `failed_job_ids` longtext NOT NULL,
  `options` mediumtext DEFAULT NULL,
  `cancelled_at` int(11) DEFAULT NULL,
  `created_at` int(11) NOT NULL,
  `finished_at` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '0001_01_01_000000_create_users_table', 1),
(2, '0001_01_01_000001_create_cache_table', 1),
(3, '0001_01_01_000002_create_jobs_table', 1),
(4, '2024_05_07_000001_create_categories_table', 1),
(5, '2024_05_07_000001_create_units_table', 1),
(6, '2024_05_07_000002_create_brands_table', 1),
(7, '2024_05_07_000003_create_products_table', 1),
(8, '2025_05_05_165450_create_customers_table', 1),
(9, '2025_05_05_165529_create_incomes_table', 1),
(10, '2025_05_05_165648_create_expenses_table', 1),
(11, '2025_05_07_000001_add_columns_to_products_table', 1),
(12, '2025_05_07_133000_create_sessions_table', 1),
(13, '2025_05_07_201616_create_services_table', 1),
(14, '2025_05_08_042553_add_type_to_categories_table', 1),
(15, '2025_05_09_131401_create_persons_table', 1),
(16, '2025_05_09_181243_create_provinces_table', 1),
(17, '2025_05_09_184747_create_cities_table', 1),
(18, '2025_05_09_222737_add_company_name_to_persons_table', 1),
(19, '2025_05_09_223557_add_type_to_persons_table', 2),
(20, '2025_05_10_042901_add_missing_fields_to_persons_table', 3),
(21, '2025_05_10_074702_create_bank_accounts_table', 4),
(22, '2025_05_10_080907_add_title_to_persons_table', 5),
(23, '2025_05_10_132650_create_invoices_table', 6),
(24, '2025_05_10_135943_add_number_column_to_invoices_table', 7),
(25, '2025_05_10_190407_create_currencies_table', 8),
(26, '2025_05_11_002051_create_sellers_table', 9),
(27, '2025_05_11_011033_create_seller_bank_accounts_table', 10),
(28, '2025_05_11_071453_add_price_to_products_table', 11);

-- --------------------------------------------------------

--
-- Table structure for table `persons`
--

CREATE TABLE `persons` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `accounting_code` varchar(255) NOT NULL,
  `type` varchar(255) DEFAULT NULL,
  `first_name` varchar(255) DEFAULT NULL,
  `last_name` varchar(255) DEFAULT NULL,
  `nickname` varchar(255) DEFAULT NULL,
  `credit_limit` int(11) DEFAULT NULL,
  `price_list` varchar(255) DEFAULT NULL,
  `tax_type` varchar(255) DEFAULT NULL,
  `national_code` varchar(255) DEFAULT NULL,
  `economic_code` varchar(255) DEFAULT NULL,
  `registration_number` varchar(255) DEFAULT NULL,
  `branch_code` varchar(255) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `address` text DEFAULT NULL,
  `country` varchar(255) DEFAULT NULL,
  `province` bigint(20) UNSIGNED DEFAULT NULL,
  `city` bigint(20) UNSIGNED DEFAULT NULL,
  `postal_code` varchar(255) DEFAULT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `mobile` varchar(255) DEFAULT NULL,
  `fax` varchar(255) DEFAULT NULL,
  `phone1` varchar(255) DEFAULT NULL,
  `phone2` varchar(255) DEFAULT NULL,
  `phone3` varchar(255) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `website` varchar(255) DEFAULT NULL,
  `birth_date` date DEFAULT NULL,
  `marriage_date` date DEFAULT NULL,
  `join_date` date DEFAULT NULL,
  `company_name` varchar(255) DEFAULT NULL,
  `title` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `persons`
--

INSERT INTO `persons` (`id`, `accounting_code`, `type`, `first_name`, `last_name`, `nickname`, `credit_limit`, `price_list`, `tax_type`, `national_code`, `economic_code`, `registration_number`, `branch_code`, `description`, `address`, `country`, `province`, `city`, `postal_code`, `phone`, `mobile`, `fax`, `phone1`, `phone2`, `phone3`, `email`, `website`, `birth_date`, `marriage_date`, `join_date`, `company_name`, `title`, `created_at`, `updated_at`) VALUES
(6, 'person-10003', 'customer', 'مهدی', 'اکرادی', NULL, 0, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'استان', 'ایران', 2, 75, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-05-10 04:08:10', '2025-05-10 04:08:10'),
(7, 'person-10004', 'customer', 'رضا', 'اکرادی', 'سیب', 500000, '1', '5', '573008971', '1457587', '8562', '2652', 'یبل', 'سیبیسب', 'ایران', 2, 101, '9647147735', '65465', '6565', '6565', '56656565', '3213', '849', '61564', '98', NULL, NULL, NULL, NULL, NULL, '2025-05-10 04:16:31', '2025-05-10 04:16:31'),
(8, 'person-10005', 'customer', 'محمد', 'اسماعیلی', NULL, 0, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'شهر', 'ایران', 2, 101, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'سیب', 'سیبس', '2025-05-10 04:40:32', '2025-05-10 04:40:32'),
(9, 'person-10006', 'customer', 'بیس', 'ظیبل', NULL, 0, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'یبلظس', 'ایران', 5, 408, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-05-10 05:14:14', '2025-05-10 05:14:14'),
(10, 'person-10007', 'shareholder', 'مهدی', 'سیبسیبیرب', NULL, 0, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'سیبسیرذ', 'ایران', 4, 102, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-05-10 05:17:57', '2025-05-10 05:17:57'),
(11, 'person-10008', 'customer', 'مهدی', 'عباس', NULL, 0, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'سیب', 'ایران', 2, 75, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-05-10 05:41:11', '2025-05-10 05:41:11'),
(12, 'person-10009', 'customer', 'سیب', 'اکرادی', 'یبلر یبر', 0, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'بیسغعتبنیغع', 'ایران', 3, 20, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-05-10 05:42:17', '2025-05-10 05:42:17'),
(13, 'person-10010', 'supplier', 'یبل', 'یبل', NULL, 0, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'بیل', 'ایران', 3, 111, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-05-10 05:47:48', '2025-05-10 05:47:48');

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

CREATE TABLE `products` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `code` varchar(255) DEFAULT NULL,
  `category_id` bigint(20) UNSIGNED NOT NULL,
  `brand_id` bigint(20) UNSIGNED DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `gallery` longtext DEFAULT NULL CHECK (json_valid(`gallery`)),
  `video` varchar(255) DEFAULT NULL,
  `short_desc` text DEFAULT NULL,
  `description` text DEFAULT NULL,
  `stock` int(11) NOT NULL DEFAULT 0,
  `price` decimal(16,2) DEFAULT NULL,
  `min_stock` int(11) NOT NULL DEFAULT 0,
  `unit` varchar(255) NOT NULL DEFAULT 'عدد',
  `barcode` varchar(255) DEFAULT NULL,
  `is_active` tinyint(1) NOT NULL DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `weight` int(11) DEFAULT NULL,
  `buy_price` bigint(20) DEFAULT NULL,
  `sell_price` bigint(20) DEFAULT NULL,
  `discount` int(11) DEFAULT NULL,
  `store_barcode` varchar(100) DEFAULT NULL,
  `attributes` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `products`
--

INSERT INTO `products` (`id`, `name`, `code`, `category_id`, `brand_id`, `image`, `gallery`, `video`, `short_desc`, `description`, `stock`, `price`, `min_stock`, `unit`, `barcode`, `is_active`, `created_at`, `updated_at`, `weight`, `buy_price`, `sell_price`, `discount`, `store_barcode`, `attributes`) VALUES
(1, 'ماوس مخصوص بازی تسکو مدل TM 765GA', 'products-100001', 3, 1, NULL, '[null]', NULL, 'سشثبشص', 'شصثقث', 15, NULL, 2, 'عدد', 'BARCODE-67143', 1, '2025-05-11 03:34:10', '2025-05-11 03:34:10', 150, 150000, 250000, NULL, 'BARCODE-399738', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `provinces`
--

CREATE TABLE `provinces` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `provinces`
--

INSERT INTO `provinces` (`id`, `name`) VALUES
(1, 'آذربایجان شرقی'),
(2, 'آذربایجان غربی'),
(3, 'اردبیل'),
(4, 'اصفهان'),
(5, 'البرز'),
(6, 'ایلام'),
(7, 'بوشهر'),
(8, 'تهران'),
(9, 'چهارمحال و بختیاری'),
(10, 'خراسان جنوبی'),
(11, 'خراسان رضوی'),
(12, 'خراسان شمالی'),
(13, 'خوزستان'),
(14, 'زنجان'),
(15, 'سمنان'),
(16, 'سیستان و بلوچستان'),
(17, 'فارس'),
(18, 'قزوین'),
(19, 'قم'),
(20, 'کردستان'),
(21, 'کرمان'),
(22, 'کرمانشاه'),
(23, 'کهگیلویه و بویراحمد'),
(24, 'گلستان'),
(25, 'گیلان'),
(26, 'لرستان'),
(27, 'مازندران'),
(28, 'مرکزی'),
(29, 'هرمزگان'),
(30, 'همدان'),
(31, 'یزد');

-- --------------------------------------------------------

--
-- Table structure for table `sellers`
--

CREATE TABLE `sellers` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `seller_code` varchar(255) NOT NULL,
  `first_name` varchar(255) DEFAULT NULL,
  `last_name` varchar(255) DEFAULT NULL,
  `nickname` varchar(255) DEFAULT NULL,
  `mobile` varchar(255) DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `code_editable` tinyint(1) NOT NULL DEFAULT 0,
  `company_name` varchar(255) DEFAULT NULL,
  `title` varchar(255) DEFAULT NULL,
  `national_code` varchar(255) DEFAULT NULL,
  `economic_code` varchar(255) DEFAULT NULL,
  `registration_number` varchar(255) DEFAULT NULL,
  `branch_code` varchar(255) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `sellers`
--

INSERT INTO `sellers` (`id`, `seller_code`, `first_name`, `last_name`, `nickname`, `mobile`, `image`, `code_editable`, `company_name`, `title`, `national_code`, `economic_code`, `registration_number`, `branch_code`, `description`, `created_at`, `updated_at`) VALUES
(1, 'Seller-10001', 'مصطفی', 'اکرادی', NULL, '09380072019', 'sellers/anyT0XEwFbhRBeSzIKITNLx9GHJQIFkjB1dDYhMt.png', 0, NULL, 'اصلی', '5730008971', NULL, NULL, NULL, NULL, '2025-05-10 21:38:55', '2025-05-10 23:02:18'),
(2, 'Seller-10002', 'حسن', 'عباس آبادعربی', NULL, NULL, 'sellers/bjITx55PTmbFHRzO6dpaMvjvhlTJ47nITu58aJ44.png', 0, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-05-11 01:13:47', '2025-05-11 01:13:55');

-- --------------------------------------------------------

--
-- Table structure for table `seller_bank_accounts`
--

CREATE TABLE `seller_bank_accounts` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `seller_id` bigint(20) UNSIGNED NOT NULL,
  `bank_name` varchar(255) DEFAULT NULL,
  `account_number` varchar(255) DEFAULT NULL,
  `card_number` varchar(255) DEFAULT NULL,
  `iban` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `seller_bank_accounts`
--

INSERT INTO `seller_bank_accounts` (`id`, `seller_id`, `bank_name`, `account_number`, `card_number`, `iban`, `created_at`, `updated_at`) VALUES
(3, 1, 'ملی', '0348801983004', '6037998265002005', NULL, '2025-05-10 23:02:18', '2025-05-10 23:02:18');

-- --------------------------------------------------------

--
-- Table structure for table `services`
--

CREATE TABLE `services` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `code` varchar(255) NOT NULL,
  `name` varchar(255) NOT NULL,
  `category_id` bigint(20) UNSIGNED DEFAULT NULL,
  `price` bigint(20) DEFAULT NULL,
  `is_active` tinyint(1) NOT NULL DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `sessions`
--

CREATE TABLE `sessions` (
  `id` varchar(255) NOT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `ip_address` varchar(45) DEFAULT NULL,
  `user_agent` text DEFAULT NULL,
  `payload` text NOT NULL,
  `last_activity` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `sessions`
--

INSERT INTO `sessions` (`id`, `user_id`, `ip_address`, `user_agent`, `payload`, `last_activity`) VALUES
('IKTeIYKqQ4W8jBbhiy4KLT4Bj5WGvVzrceZCyAoH', 1, '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/135.0.0.0 Safari/537.36', 'YTo0OntzOjY6Il90b2tlbiI7czo0MDoiMTlyemR2eVl1SmJOMW1rVFhIcE5ZZ2pKTWF6aFpySlA5cnViV1lPNyI7czo1MDoibG9naW5fd2ViXzU5YmEzNmFkZGMyYjJmOTQwMTU4MGYwMTRjN2Y1OGVhNGUzMDk4OWQiO2k6MTtzOjk6Il9wcmV2aW91cyI7YToxOntzOjM6InVybCI7czo0MjoiaHR0cDovLzEyNy4wLjAuMTo4MDAwL2ludm9pY2VzL25leHQtbnVtYmVyIjt9czo2OiJfZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319fQ==', 1746951105);

-- --------------------------------------------------------

--
-- Table structure for table `units`
--

CREATE TABLE `units` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `units`
--

INSERT INTO `units` (`id`, `title`, `created_at`, `updated_at`) VALUES
(1, 'عدد', '2025-05-11 03:33:38', '2025-05-11 03:33:38');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) NOT NULL,
  `remember_token` varchar(100) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `email_verified_at`, `password`, `remember_token`, `created_at`, `updated_at`) VALUES
(1, 'مصطفی اکرادی', 'akradim@gmail.com', NULL, '$2y$12$AoMbsoZLRypqMlVr8Oj6D.UGYe9Ysvqt3W.VWirZ8SDNalxD3r6vK', 'jbtUn07sGcqXuoszhPbnePgM6sUSWtCXYI00hAoGjcm4VNaVLukXEMZtki8K', '2025-05-09 19:02:19', '2025-05-09 19:02:19');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `bank_accounts`
--
ALTER TABLE `bank_accounts`
  ADD PRIMARY KEY (`id`),
  ADD KEY `bank_accounts_person_id_index` (`person_id`);

--
-- Indexes for table `brands`
--
ALTER TABLE `brands`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `cache`
--
ALTER TABLE `cache`
  ADD PRIMARY KEY (`key`);

--
-- Indexes for table `cache_locks`
--
ALTER TABLE `cache_locks`
  ADD PRIMARY KEY (`key`);

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`),
  ADD KEY `categories_parent_id_foreign` (`parent_id`);

--
-- Indexes for table `cities`
--
ALTER TABLE `cities`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `cities_province_id_name_unique` (`province_id`,`name`) USING BTREE;

--
-- Indexes for table `currencies`
--
ALTER TABLE `currencies`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `customers`
--
ALTER TABLE `customers`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `customers_email_unique` (`email`);

--
-- Indexes for table `expenses`
--
ALTER TABLE `expenses`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- Indexes for table `incomes`
--
ALTER TABLE `incomes`
  ADD PRIMARY KEY (`id`),
  ADD KEY `incomes_customer_id_foreign` (`customer_id`);

--
-- Indexes for table `invoices`
--
ALTER TABLE `invoices`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `invoices_number_unique` (`number`);

--
-- Indexes for table `jobs`
--
ALTER TABLE `jobs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `jobs_queue_index` (`queue`);

--
-- Indexes for table `job_batches`
--
ALTER TABLE `job_batches`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `persons`
--
ALTER TABLE `persons`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `persons_accounting_code_unique` (`accounting_code`);

--
-- Indexes for table `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `products_code_unique` (`code`),
  ADD KEY `products_category_id_foreign` (`category_id`),
  ADD KEY `products_brand_id_foreign` (`brand_id`);

--
-- Indexes for table `provinces`
--
ALTER TABLE `provinces`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `provinces_name_unique` (`name`) USING BTREE;

--
-- Indexes for table `sellers`
--
ALTER TABLE `sellers`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `sellers_seller_code_unique` (`seller_code`);

--
-- Indexes for table `seller_bank_accounts`
--
ALTER TABLE `seller_bank_accounts`
  ADD PRIMARY KEY (`id`),
  ADD KEY `seller_bank_accounts_seller_id_foreign` (`seller_id`);

--
-- Indexes for table `services`
--
ALTER TABLE `services`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `services_code_unique` (`code`),
  ADD KEY `services_category_id_foreign` (`category_id`);

--
-- Indexes for table `sessions`
--
ALTER TABLE `sessions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `sessions_user_id_index` (`user_id`),
  ADD KEY `sessions_last_activity_index` (`last_activity`);

--
-- Indexes for table `units`
--
ALTER TABLE `units`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `units_title_unique` (`title`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `bank_accounts`
--
ALTER TABLE `bank_accounts`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `brands`
--
ALTER TABLE `brands`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `cities`
--
ALTER TABLE `cities`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1354;

--
-- AUTO_INCREMENT for table `currencies`
--
ALTER TABLE `currencies`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `customers`
--
ALTER TABLE `customers`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `expenses`
--
ALTER TABLE `expenses`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `incomes`
--
ALTER TABLE `incomes`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `invoices`
--
ALTER TABLE `invoices`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `jobs`
--
ALTER TABLE `jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=29;

--
-- AUTO_INCREMENT for table `persons`
--
ALTER TABLE `persons`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT for table `products`
--
ALTER TABLE `products`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT for table `provinces`
--
ALTER TABLE `provinces`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=32;

--
-- AUTO_INCREMENT for table `sellers`
--
ALTER TABLE `sellers`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `seller_bank_accounts`
--
ALTER TABLE `seller_bank_accounts`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `services`
--
ALTER TABLE `services`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `units`
--
ALTER TABLE `units`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `bank_accounts`
--
ALTER TABLE `bank_accounts`
  ADD CONSTRAINT `bank_accounts_person_id_foreign` FOREIGN KEY (`person_id`) REFERENCES `persons` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `categories`
--
ALTER TABLE `categories`
  ADD CONSTRAINT `categories_parent_id_foreign` FOREIGN KEY (`parent_id`) REFERENCES `categories` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `cities`
--
ALTER TABLE `cities`
  ADD CONSTRAINT `cities_province_id_foreign` FOREIGN KEY (`province_id`) REFERENCES `provinces` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `incomes`
--
ALTER TABLE `incomes`
  ADD CONSTRAINT `incomes_customer_id_foreign` FOREIGN KEY (`customer_id`) REFERENCES `customers` (`id`) ON DELETE SET NULL;

--
-- Constraints for table `products`
--
ALTER TABLE `products`
  ADD CONSTRAINT `products_brand_id_foreign` FOREIGN KEY (`brand_id`) REFERENCES `brands` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `products_category_id_foreign` FOREIGN KEY (`category_id`) REFERENCES `categories` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `seller_bank_accounts`
--
ALTER TABLE `seller_bank_accounts`
  ADD CONSTRAINT `seller_bank_accounts_seller_id_foreign` FOREIGN KEY (`seller_id`) REFERENCES `sellers` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `services`
--
ALTER TABLE `services`
  ADD CONSTRAINT `services_category_id_foreign` FOREIGN KEY (`category_id`) REFERENCES `categories` (`id`) ON DELETE SET NULL;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
